test/fixtures/incoming_payments.yml

# = Informations
#
# == License
#
# Ekylibre - Simple agricultural ERP
# Copyright (C) 2008-2009 Brice Texier, Thibaud Merigon
# Copyright (C) 2010-2012 Brice Texier
# Copyright (C) 2012-2014 Brice Texier, David Joulin
# Copyright (C) 2015-2020 Ekylibre SAS
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU Affero General Public License as published by
# the Free Software Foundation, either version 3 of the License, or
# any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU Affero General Public License for more details.
#
# You should have received a copy of the GNU Affero General Public License
# along with this program.  If not, see http://www.gnu.org/licenses.
#
# == Table: incoming_payments
#
#  accounted_at          :datetime
#  affair_id             :integer
#  amount                :decimal(19, 4)   not null
#  bank_account_number   :string
#  bank_check_number     :string
#  bank_name             :string
#  codes                 :jsonb
#  commission_account_id :integer
#  commission_amount     :decimal(19, 4)   default(0.0), not null
#  created_at            :datetime         not null
#  creator_id            :integer
#  currency              :string           not null
#  custom_fields         :jsonb
#  deposit_id            :integer
#  downpayment           :boolean          default(TRUE), not null
#  id                    :integer          not null, primary key
#  journal_entry_id      :integer
#  lock_version          :integer          default(0), not null
#  mode_id               :integer          not null
#  number                :string
#  paid_at               :datetime
#  payer_id              :integer
#  providers             :jsonb
#  receipt               :text
#  received              :boolean          default(TRUE), not null
#  responsible_id        :integer
#  scheduled             :boolean          default(FALSE), not null
#  to_bank_at            :datetime         not null
#  updated_at            :datetime         not null
#  updater_id            :integer
#
---
incoming_payments_001:
  accounted_at: 2014-11-05 14:07:53.334739000 Z
  affair_id: 20
  amount: 123.0
  commission_amount: 0.0
  created_at: 2014-10-31 17:19:32.000000000 Z
  creator_id: 1
  currency: EUR
  deposit_id: 4
  downpayment: true
  id: 1
  journal_entry_id: 15
  lock_version: 1
  mode_id: 1
  number: IP001
  payer_id: 6
  received: true
  scheduled: true
  to_bank_at: 2009-07-18 22:00:00.000000000 Z
  updated_at: 2014-11-05 12:45:57.840651000 Z
  updater_id: 1
incoming_payments_002:
  accounted_at: 2014-11-07 13:55:38.758657000 Z
  affair_id: 24
  amount: 150.0
  bank_account_number: ''
  bank_check_number: ''
  bank_name: ''
  commission_amount: 0.0
  created_at: 2014-10-31 17:19:32.000000000 Z
  creator_id: 1
  currency: EUR
  deposit_id: 5
  downpayment: true
  id: 2
  journal_entry_id: 7
  lock_version: 2
  mode_id: 1
  number: IP002
  payer_id: 6
  received: true
  responsible_id: 1
  scheduled: true
  to_bank_at: 2009-07-18 22:00:00.000000000 Z
  updated_at: 2014-11-05 12:46:06.215514000 Z
  updater_id: 1
incoming_payments_003:
  accounted_at: 2014-11-05 14:07:45.790887000 Z
  affair_id: 21
  amount: 100.0
  bank_account_number: ''
  bank_check_number: ''
  bank_name: ''
  commission_amount: 0.0
  created_at: 2014-10-31 17:19:32.000000000 Z
  creator_id: 1
  currency: EUR
  deposit_id: 4
  downpayment: true
  id: 3
  journal_entry_id: 8
  lock_version: 2
  mode_id: 1
  number: IP003
  payer_id: 8
  received: true
  scheduled: false
  to_bank_at: 2009-07-18 22:00:00.000000000 Z
  updated_at: 2014-11-05 12:45:57.743007000 Z
  updater_id: 1
incoming_payments_004:
  accounted_at: 2014-11-05 14:07:42.844167000 Z
  affair_id: 22
  amount: 448.98
  commission_amount: 0.0
  created_at: 2014-10-31 18:51:59.234679000 Z
  creator_id: 1
  currency: EUR
  downpayment: true
  id: 4
  lock_version: 0
  mode_id: 2
  number: IP004
  paid_at: 2014-10-30 23:00:00.000000000 Z
  payer_id: 8
  received: false
  responsible_id: 1
  scheduled: false
  to_bank_at: 2014-10-30 23:00:00.000000000 Z
  updated_at: 2014-10-31 18:51:59.234679000 Z
  updater_id: 1
incoming_payments_005:
  accounted_at: 2014-11-05 09:58:15.883989000 Z
  affair_id: 10
  amount: 1164.0
  bank_account_number: ''
  bank_check_number: ''
  bank_name: ''
  commission_amount: 0.0
  created_at: 2014-11-05 09:58:15.763955000 Z
  creator_id: 1
  currency: EUR
  downpayment: true
  id: 5
  journal_entry_id: 13
  lock_version: 0
  mode_id: 2
  number: R2014000001
  paid_at: 2014-11-04 23:00:00.000000000 Z
  payer_id: 7
  received: true
  responsible_id: 1
  scheduled: false
  to_bank_at: 2014-11-01 00:30:00.000000000 Z
  updated_at: 2014-11-05 09:58:15.763955000 Z
  updater_id: 1
incoming_payments_006:
  accounted_at: 2014-11-05 10:02:25.622501000 Z
  affair_id: 12
  amount: 300.0
  bank_account_number: '74125963594'
  bank_check_number: '1234587'
  bank_name: GHB
  commission_amount: 0.0
  created_at: 2014-11-05 10:02:25.617133000 Z
  creator_id: 1
  currency: EUR
  downpayment: true
  id: 6
  lock_version: 0
  mode_id: 2
  number: R2014000002
  paid_at: 2014-11-04 23:00:00.000000000 Z
  payer_id: 13
  received: false
  responsible_id: 1
  scheduled: false
  to_bank_at: 2014-11-04 23:00:00.000000000 Z
  updated_at: 2014-11-05 10:02:25.617133000 Z
  updater_id: 1
incoming_payments_007:
  accounted_at: 2014-11-05 13:36:45.646520000 Z
  affair_id: 17
  amount: 20.0
  bank_account_number: ''
  bank_check_number: ''
  bank_name: ''
  commission_amount: 0.0
  created_at: 2014-11-05 13:36:45.639839000 Z
  creator_id: 1
  currency: EUR
  downpayment: true
  id: 7
  lock_version: 0
  mode_id: 1
  number: R2014000003
  paid_at: 2014-11-04 23:00:00.000000000 Z
  payer_id: 10
  received: false
  responsible_id: 1
  scheduled: false
  to_bank_at: 2014-11-01 23:00:00.000000000 Z
  updated_at: 2014-11-05 13:36:45.639839000 Z
  updater_id: 1
incoming_payments_008:
  accounted_at: 2016-11-20 22:09:40.218918000 Z
  affair_id: 43
  amount: 447.12
  bank_account_number: ''
  bank_check_number: ''
  bank_name: ''
  commission_amount: 0.0
  created_at: 2016-11-20 22:09:40.159990000 Z
  creator_id: 1
  currency: EUR
  downpayment: true
  id: 8
  journal_entry_id: 91
  lock_version: 0
  mode_id: 2
  number: R2016000001
  paid_at: 2016-11-19 23:00:00.000000000 Z
  payer_id: 14
  received: true
  responsible_id: 1
  scheduled: false
  to_bank_at: 2016-11-19 23:00:00.000000000 Z
  updated_at: 2016-11-20 22:09:40.159990000 Z
  updater_id: 1
incoming_payments_009:
  accounted_at: 2016-11-20 22:10:53.000679000 Z
  affair_id: 45
  amount: 37.44
  bank_account_number: ''
  bank_check_number: ''
  bank_name: ''
  commission_amount: 0.0
  created_at: 2016-11-20 22:10:52.940167000 Z
  creator_id: 1
  currency: EUR
  downpayment: true
  id: 9
  journal_entry_id: 94
  lock_version: 0
  mode_id: 2
  number: R2016000002
  paid_at: 2016-11-19 23:00:00.000000000 Z
  payer_id: 9
  received: true
  responsible_id: 1
  scheduled: false
  to_bank_at: 2016-11-19 23:00:00.000000000 Z
  updated_at: 2016-11-20 22:10:52.940167000 Z
  updater_id: 1
incoming_payments_010:
  accounted_at: 2016-12-20 08:58:53.128227000 Z
  affair_id: 52
  amount: 463.25
  bank_account_number: ''
  bank_check_number: ''
  bank_name: ''
  commission_amount: 0.0
  created_at: 2016-12-20 08:58:52.977894000 Z
  creator_id: 1
  currency: EUR
  downpayment: true
  id: 10
  journal_entry_id: 111
  lock_version: 0
  mode_id: 1
  number: R2016000003
  paid_at: 2016-12-19 23:00:00.000000000 Z
  payer_id: 9
  received: true
  responsible_id: 1
  scheduled: false
  to_bank_at: 2016-12-19 23:00:00.000000000 Z
  updated_at: 2016-12-20 08:58:52.977894000 Z
  updater_id: 1
